In [1]:
%%capture
%load_ext sql
%sql sqlite:///stores.db

In [2]:
%%sql
SELECT
    name
    type
FROM sqlite_master
WHERE type IN ("table","view");

 * sqlite:///stores.db
Done.

[('customers',),
 ('employees',),
 ('offices',),
 ('orderdetails',),
 ('orders',),
 ('payments',),
 ('productlines',),
 ('products',)]

In [3]:
%%sql

SELECT 'Customers' AS table_name, 
       13 AS number_of_attribute,
       COUNT(*) AS number_of_row
  FROM Customers
  
UNION ALL

SELECT 'Products' AS table_name, 
       9 AS number_of_attribute,
       COUNT(*) AS number_of_row
  FROM Products

UNION ALL

SELECT 'ProductLines' AS table_name, 
       4 AS number_of_attribute,
       COUNT(*) AS number_of_row
  FROM ProductLines

UNION ALL

SELECT 'Orders' AS table_name, 
       7 AS number_of_attribute,
       COUNT(*) AS number_of_row
  FROM Orders

UNION ALL

SELECT 'OrderDetails' AS table_name, 
       5 AS number_of_attribute,
       COUNT(*) AS number_of_row
  FROM OrderDetails

UNION ALL

SELECT 'Payments' AS table_name, 
       4 AS number_of_attribute,
       COUNT(*) AS number_of_row
  FROM Payments

UNION ALL

SELECT 'Employees' AS table_name, 
       8 AS number_of_attribute,
       COUNT(*) AS number_of_row
  FROM Employees

UNION ALL

SELECT 'Offices' AS table_name, 
       9 AS number_of_attribute,
       COUNT(*) AS number_of_row
  FROM Offices;

 * sqlite:///stores.db
Done.

[('Customers', 13, 122),
 ('Products', 9, 110),
 ('ProductLines', 4, 7),
 ('Orders', 7, 326),
 ('OrderDetails', 5, 2996),
 ('Payments', 4, 273),
 ('Employees', 8, 23),
 ('Offices', 9, 7)]

Question 1: Which products should we order more of or less of?

In [4]:
%%sql

select od.productCode, p.productName, round((sum(od.quantityOrdered)*1.0)/p.quantityInStock) as low_stock

from Products as p
join OrderDetails as od
on od.productCode = p.productCode

group by od.productCode
order by low_stock desc

limit 10

 * sqlite:///stores.db
Done.

[('S24_2000', '1960 BSA Gold Star DBD34', 68.0),
 ('S12_1099', '1968 Ford Mustang', 14.0),
 ('S32_4289', '1928 Ford Phaeton Deluxe', 7.0),
 ('S32_1374', '1997 BMW F650 ST', 6.0),
 ('S18_2248', '1911 Ford Town Car', 2.0),
 ('S18_2795', '1928 Mercedes-Benz SSK', 2.0),
 ('S50_4713', '2002 Yamaha YZR M1', 2.0),
 ('S700_3167', 'F/A 18 Hornet 1/72', 2.0),
 ('S72_3212', 'Pont Yacht', 2.0),
 ('S12_1666', '1958 Setra Bus', 1.0)]

In [5]:
%%sql 

select productCode, sum(quantityOrdered * priceEach) as product_performance
 
from OrderDetails
group by productCode
order by product_performance desc
limit 10

 * sqlite:///stores.db
Done.

[('S18_3232', 276839.98),
 ('S12_1108', 190755.86),
 ('S10_1949', 190017.95999999996),
 ('S10_4698', 170685.99999999997),
 ('S12_1099', 161531.47999999992),
 ('S12_3891', 152543.02),
 ('S18_1662', 144959.90999999997),
 ('S18_2238', 142530.62999999998),
 ('S18_1749', 140535.60000000003),
 ('S12_2823', 135767.03000000003)]

In [6]:
%%sql
WITH low_stock_table AS
(
SELECT od.productCode, p.productName, ROUND((SUM(od.quantityOrdered)*1.0)/p.quantityInStock) AS low_stock

  FROM Products as p
  JOIN OrderDetails as od
    ON od.productCode = p.productCode

 GROUP BY od.productCode
 ORDER BY low_stock desc
)  

SELECT productCode, SUM(quantityOrdered * priceEach) AS product_performance
 
  FROM OrderDetails
 WHERE productCode IN (SELECT productCode
                         FROM low_stock_table)
 GROUP BY productCode
 ORDER BY product_performance desc
 LIMIT 10

 * sqlite:///stores.db
Done.

[('S18_3232', 276839.98),
 ('S12_1108', 190755.86),
 ('S10_1949', 190017.95999999996),
 ('S10_4698', 170685.99999999997),
 ('S12_1099', 161531.47999999992),
 ('S12_3891', 152543.02),
 ('S18_1662', 144959.90999999997),
 ('S18_2238', 142530.62999999998),
 ('S18_1749', 140535.60000000003),
 ('S12_2823', 135767.03000000003)]

Q2:how should we match marketing and communication strategies to customer behaviors?

In [7]:
%%sql
-- revenue by customer
SELECT o.customerNumber, SUM(quantityOrdered * (priceEach - buyPrice)) AS revenue
  FROM products p
  JOIN orderdetails od
    ON p.productCode = od.productCode
  JOIN orders o
    ON o.orderNumber = od.orderNumber
 GROUP BY o.customerNumber;

 * sqlite:///stores.db
Done.

[(103, 10063.800000000001),
 (112, 31312.72),
 (114, 70311.06999999999),
 (119, 60875.30000000001),
 (121, 41391.52),
 (124, 236769.38999999998),
 (128, 27728.34),
 (129, 28092.43),
 (131, 58669.10000000001),
 (141, 326519.65999999986),
 (144, 25138.38),
 (145, 50973.68000000001),
 (146, 53211.19),
 (148, 60477.37999999999),
 (151, 72370.09000000001),
 (157, 40429.55),
 (161, 41510.76000000001),
 (166, 41305.17000000001),
 (167, 40592.060000000005),
 (171, 27143.39),
 (172, 34650.16999999999),
 (173, 13734.7),
 (175, 41313.51),
 (177, 24360.180000000004),
 (181, 28279.500000000004),
 (186, 38808.53),
 (187, 60095.85999999999),
 (189, 19588.29),
 (198, 6586.0199999999995),
 (201, 43523.64000000001),
 (202, 28882.989999999994),
 (204, 24296.9),
 (205, 40397.88),
 (209, 31526.600000000006),
 (211, 16868.68),
 (216, 24113.539999999997),
 (219, 2610.870000000001),
 (227, 34655.62000000001),
 (233, 25856.86),
 (239, 31594.699999999997),
 (240, 26808.79),
 (242, 23905.16),
 (249, 34100.630000000005),
 (250, 28390.809999999998),
 (256, 24610.799999999996),
 (259, 36744.009999999995),
 (260, 24118.930000000004),
 (276, 54551.65999999999),
 (278, 52309.630000000034),
 (282, 52331.44999999999),
 (286, 36337.69),
 (298, 43393.749999999985),
 (299, 25665.760000000002),
 (311, 38334.95),
 (314, 25861.96000000001),
 (319, 31815.010000000002),
 (320, 39136.13999999999),
 (321, 55674.27999999999),
 (323, 60013.99),
 (324, 31667.93),
 (328, 32240.57),
 (333, 22579.18),
 (334, 40095.85),
 (339, 20737.789999999997),
 (344, 18953.3),
 (347, 14928.369999999999),
 (350, 27184.740000000005),
 (353, 52698.66000000001),
 (357, 39321.90999999999),
 (362, 32549.53),
 (363, 45090.38999999999),
 (379, 28969.090000000007),
 (381, 11693.99),
 (382, 54724.680000000015),
 (385, 35987.68),
 (386, 48516.670000000006),
 (398, 43487.87999999999),
 (406, 38755.5),
 (412, 38399.17999999999),
 (415, 13033.35),
 (424, 26001.55),
 (447, 18957.409999999996),
 (448, 46777.54),
 (450, 55931.369999999995),
 (452, 18358.11),
 (455, 29265.9),
 (456, 13066.02),
 (458, 49192.39),
 (462, 36886.049999999996),
 (471, 22433.820000000003),
 (473, 9532.93),
 (475, 17186.93),
 (484, 21225.65),
 (486, 33598.57000000001),
 (487, 17230.12),
 (489, 10868.039999999999),
 (495, 25244.69),
 (496, 51771.5)]

In [8]:
%%sql

-- Top 5 VIP customers
WITH 

money_in_by_customer_table AS (
SELECT o.customerNumber, SUM(quantityOrdered * (priceEach - buyPrice)) AS revenue
  FROM products p
  JOIN orderdetails od
    ON p.productCode = od.productCode
  JOIN orders o
    ON o.orderNumber = od.orderNumber
 GROUP BY o.customerNumber
)

SELECT contactLastName, contactFirstName, city, country, mc.revenue
  FROM customers c
  JOIN money_in_by_customer_table mc
    ON mc.customerNumber = c.customerNumber
 ORDER BY mc.revenue DESC
 LIMIT 5;

 * sqlite:///stores.db
Done.

[('Freyre', 'Diego ', 'Madrid', 'Spain', 326519.65999999986),
 ('Nelson', 'Susan', 'San Rafael', 'USA', 236769.38999999998),
 ('Young', 'Jeff', 'NYC', 'USA', 72370.09000000001),
 ('Ferguson', 'Peter', 'Melbourne', 'Australia', 70311.06999999999),
 ('Labrune', 'Janine ', 'Nantes', 'France', 60875.30000000001)]

In [9]:
%%sql

 -- Top 5 less engaging customers
WITH 

money_in_by_customer_table AS (
SELECT o.customerNumber, SUM(quantityOrdered * (priceEach - buyPrice)) AS revenue
  FROM products p
  JOIN orderdetails od
    ON p.productCode = od.productCode
  JOIN orders o
    ON o.orderNumber = od.orderNumber
 GROUP BY o.customerNumber
)

SELECT contactLastName, contactFirstName, city, country, mc.revenue
  FROM customers c
  JOIN money_in_by_customer_table mc
    ON mc.customerNumber = c.customerNumber
 ORDER BY mc.revenue
 LIMIT 5;

 * sqlite:///stores.db
Done.

[('Young', 'Mary', 'Glendale', 'USA', 2610.870000000001),
 ('Taylor', 'Leslie', 'Brickhaven', 'USA', 6586.0199999999995),
 ('Ricotti', 'Franco', 'Milan', 'Italy', 9532.93),
 ('Schmitt', 'Carine ', 'Nantes', 'France', 10063.800000000001),
 ('Smith', 'Thomas ', 'London', 'UK', 10868.039999999999)]

Question 3: How much can we spend on acquiring new customers?

In [10]:
%%sql
-- Customer LTV
WITH 

money_in_by_customer_table AS (
SELECT o.customerNumber, SUM(quantityOrdered * (priceEach - buyPrice)) AS revenue
  FROM products p
  JOIN orderdetails od
    ON p.productCode = od.productCode
  JOIN orders o
    ON o.orderNumber = od.orderNumber
 GROUP BY o.customerNumber
)

SELECT AVG(mc.revenue) AS ltv
  FROM money_in_by_customer_table mc;

 * sqlite:///stores.db
Done.

[(39039.59438775511,)]